yii2-frame/controllers/backend/ShopManaerController.php

    public function actionShop(){
        $query = new \yii\db\Query();
        $shops = $query
            ->select([])
            ->from('yii_shops')
            ->orderBy('shop_id DESC')
            ->all();
---
SELECT * FROM `yii_shops` ORDER BY `shop_id` DESC

    public function actionDetail(){
        $request = Yii::$app->request;
        $shopId = intval($request->get('shop_id', 0));
        $query = new \yii\db\Query();
        $shop = $query
            ->select([])
            ->from('yii_shops')
            ->where(['shop_id'=>$shopId])
            ->one();
---
SELECT * FROM `yii_shops` WHERE `shop_id`=3

    public function actionCheck(){
        $request = Yii::$app->request;
        $isCheck = $request->get('is_check');
        $shopId = $request->get('shop_id');
        $shop = \app\models\YiiShops::findOne(['shop_id'=>$shopId]);
        $shop->is_check = $isCheck;
        $shop->save();
---
SELECT * FROM `yii_shops` WHERE `shop_id`='3'
UPDATE `yii_shops` SET `is_check`=-1 WHERE `shop_id`=3

    public function actionAuth(){
        $request = Yii::$app->request;
        $isAuth = $request->get('is_auth');
        $shopId = $request->get('shop_id');
        $shop = \app\models\YiiShops::findOne(['shop_id'=>$shopId]);
        $shop->is_auth = $isAuth;
        $shop->save();
---
SELECT * FROM `yii_shops` WHERE `shop_id`='3'
UPDATE `yii_shops` SET `is_auth`=-1 WHERE `shop_id`=3